app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
---
  def index
    if !!params[:artist_id]
      if !!@artist then @songs = @artist.songs
      else redirect_to artists_path, notice: "Artist not found."
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? AND "songs"."artist_id" = ? LIMIT 1  [["id", 12345], ["artist_id", 5]]
---
  def show
    if !!params[:artist_id]
      if !!( @song = Song.find_by(:id => params[:id], :artist_id => params[:artist_id]) ) then @song

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
---
  def set_artist
    ( @artist = Artist.find_by(:id => params[:artist_id]) ) if !!params[:artist_id]